Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/display&button/lcd/em_display_TN3P_Helper.c
// em_display.c
// Driver layer 
#include "r_cg_macrodriver.h"
#include "typedef.h"            /* GCSE Standard definitions */
#include "r_cg_wdt.h"
#include "r_cg_rtc.h"
#include "emeter3_structs.h"

// Application layer 
#include "platform.h"
#include "r_lcd_display.h"      /* LCD Display Application Layer */
#include "r_lcd_config.h"
#include "em_display.h"         /* EM Display Application Layer */
#include "event.h"
#include "emeter3_app.h"
#include "memoryOps.h"
#include "e2rom.h"
#include "tampers.h"
#include "utilities.h"
#include "r_dlms_obis_ic.h"
#include "em_display_TN3P_Helper.h"
#include "powermgmt.h"

// Display tamper condition
#include "format.h"
#include "eeprom.h"
#include "em_core.h"


extern float32_t operatingPF;

extern date_time_t g_Class03_BillingDate;
extern display_int_flag_t g_display_flag;

#define MDKW 0
#define MDKVA 1

#define MDDATE 0
#define MDTIME 1

// for selecting KVARH lag/lead or total
#define D_LAG 0
#define D_LEAD 1
#define D_TOTAL 2


const uint8_t msg_nil_tamper[8] = {LCD_CHAR_T, LCD_CHAR_A, LCD_CHAR_M, LCD_CHAR_P, LCD_CHAR_N, LCD_CHAR_I, LCD_CHAR_L, LCD_CLEAR_DIGIT};
const uint8_t msg_hv_tamper[8] = {LCD_CHAR_H, LCD_CHAR_V, LCD_MINUS_SIGN, LCD_CHAR_T, LCD_CHAR_A, LCD_CHAR_M, LCD_CHAR_P, LCD_CLEAR_DIGIT};
const uint8_t msg_lv_tamper[8] = {LCD_CHAR_L, LCD_CHAR_V, LCD_MINUS_SIGN, LCD_CHAR_T, LCD_CHAR_A, LCD_CHAR_M, LCD_CHAR_P, LCD_CLEAR_DIGIT};
const uint8_t voltage_fail_tamper[8] = {LCD_CLEAR_DIGIT, LCD_CHAR_V, LCD_CHAR_F, LCD_CHAR_T, LCD_CHAR_A, LCD_CHAR_M, LCD_CHAR_P, LCD_CLEAR_DIGIT};	// posn 0 to be replaced with r,y,b
const uint8_t voltage_unbalance_tamper[8] = {LCD_CHAR_P, LCD_CHAR_T, LCD_CHAR_U, LCD_CHAR_T, LCD_CHAR_A, LCD_CHAR_M, LCD_CHAR_P, LCD_CLEAR_DIGIT};
const uint8_t current_fail_tamper[8] = {LCD_CLEAR_DIGIT, LCD_CHAR_C, LCD_CHAR_F, LCD_CHAR_T, LCD_CHAR_A, LCD_CHAR_M, LCD_CHAR_P, LCD_CLEAR_DIGIT};	// posn 0 to be replaced with r,y,b
const uint8_t current_unbalance_tamper[8] = {LCD_CHAR_C, LCD_CHAR_T, LCD_CHAR_U, LCD_CHAR_T, LCD_CHAR_A, LCD_CHAR_M, LCD_CHAR_P, LCD_CLEAR_DIGIT};
const uint8_t current_bypass_tamper[8] = {LCD_CHAR_B, LCD_CHAR_Y, LCD_CHAR_P, LCD_CHAR_T, LCD_CHAR_A, LCD_CHAR_M, LCD_CHAR_P, LCD_CLEAR_DIGIT};
const uint8_t magnet_indication_tamper[8]={LCD_CHAR_M, LCD_CHAR_G, LCD_CHAR_T, LCD_CHAR_T, LCD_CHAR_A, LCD_CHAR_M, LCD_CHAR_P, LCD_CLEAR_DIGIT};
const uint8_t magnet_tamper_nil[8] = {LCD_CHAR_M, LCD_CHAR_G, LCD_CHAR_T, LCD_MINUS_SIGN, LCD_CHAR_N, LCD_CHAR_I, LCD_CHAR_L, LCD_CLEAR_DIGIT};
const uint8_t magnet_tamper_yes[8] = {LCD_CHAR_M, LCD_CHAR_G, LCD_CHAR_T, LCD_MINUS_SIGN, LCD_CHAR_Y, LCD_CHAR_E, 5, LCD_CLEAR_DIGIT};
const uint8_t neutral_disturbance_tamper[8] = {LCD_CHAR_N, LCD_CHAR_D, LCD_MINUS_SIGN, LCD_CHAR_T, LCD_CHAR_A, LCD_CHAR_M, LCD_CHAR_P, LCD_CLEAR_DIGIT};
const uint8_t current_reverse_tamper[8] = {LCD_CLEAR_DIGIT, LCD_CHAR_C, LCD_CHAR_R, LCD_CHAR_T, LCD_CHAR_A, LCD_CHAR_M, LCD_CHAR_P, LCD_CLEAR_DIGIT};	// posn 0 to be replaced with r,y,b
const uint8_t over_current_tamper[8] = {LCD_CLEAR_DIGIT, 0, LCD_CHAR_C, LCD_CHAR_T, LCD_CHAR_A, LCD_CHAR_M, LCD_CHAR_P, LCD_CLEAR_DIGIT};	// posn 0 to be replaced with r,y,b

// event_code_bit=findWhichBitIsOne(whichevent);	// bit numbers 1 to 15, 22, 23, 24, 29 and 30  - bit 0 is not used, others masked out

#ifdef TN3P_BOARD
uint8_t getEventGroupInfo(eventGroupInfo_t* eventGroupInfoPtr, uint8_t eventCodeBit);
#endif
void display_unrestored_tamper_time(uint8_t event_code_bit);
void display_unrestored_tamper_date(uint8_t event_code_bit);

#ifdef TN3P_BOARD
uint8_t getEventGroupInfo(eventGroupInfo_t* eventGroupInfoPtr, uint8_t eventCodeBit)
{
	uint8_t retval;
	switch(eventCodeBit)
	{
		case 0:
			retval=0;	// error
			break;
			
		case 1:	//	MISSING_POTENTIAL_R
		case 2:	//	MISSING_POTENTIAL_Y
		case 3:	//	MISSING_POTENTIAL_B
		case 4:	//	OVER_VOLTAGE
		case 5:	//	UNDER_VOLTAGE
		case 6:	//	VOLTAGE_UNBALANCED
			eventGroupInfoPtr->event_wrt_ptr=mytmprdata.tamper_events0_wrt_ptr;
			eventGroupInfoPtr->base_address=EVENTS0_BASE_ADDRESS;
			eventGroupInfoPtr->end_address=EVENTS0_END_ADDRESS;
			eventGroupInfoPtr->whichGroup=0;
			retval=1;	// ok
			break;
			
		case 7:	//	CT_REVERSED_R
		case 8:	//	CT_REVERSED_Y
		case 9:	//	CT_REVERSED_B
		case 10:	//	CT_OPEN_R
		case 11:	//	CT_OPEN_Y
		case 12:	//	CT_OPEN_B
		case 13:	//	CURRENT_UNBALANCED
		case 14:	//	CT_BYPASS
		case 15:	//	OVER_CURRENT
		case 29:	//	OVER_CURRENT_Y
		case 30:	//	OVER_CURRENT_B
			eventGroupInfoPtr->event_wrt_ptr=mytmprdata.tamper_events1_wrt_ptr;
			eventGroupInfoPtr->base_address=EVENTS1_BASE_ADDRESS;
			eventGroupInfoPtr->end_address=EVENTS1_END_ADDRESS;
			eventGroupInfoPtr->whichGroup=1;
			retval=1;	// ok
			break;
			
		case 16:	//	POWER_EVENT
			eventGroupInfoPtr->event_wrt_ptr=mytmprdata.tamper_events2_wrt_ptr;
			eventGroupInfoPtr->base_address=EVENTS2_BASE_ADDRESS;
			eventGroupInfoPtr->end_address=EVENTS2_END_ADDRESS;
			eventGroupInfoPtr->whichGroup=2;
			retval=0;	// error
			break;

		case 17:	//	RTC_TRANSACTION
		case 18:	//	MD_INTERVAL_TRANSACTION
		case 19:	//	SURVEY_INTERVAL_TRANSACTION
		case 20:	//	SINGLE_ACTION_TRANSACTION
		case 21:	//	ACTIVITY_CALENDAR_TRANSACTION
		case 27:	//	UNIDIRECTIONAL MODE SET
		case 28:	//	BIDIRECTIONAL MODE SET
			eventGroupInfoPtr->event_wrt_ptr=mytmprdata.tamper_events3_wrt_ptr;
			eventGroupInfoPtr->base_address=EVENTS3_BASE_ADDRESS;
			eventGroupInfoPtr->end_address=EVENTS3_END_ADDRESS;
			eventGroupInfoPtr->whichGroup=3;
			retval=0;	// error
			break;

		case 22:	//	MAGNET
		case 23:	//	AC_MAGNET
		case 24:	//	NEUTRAL_DISTURBANCE
		case 25:	//	LOW_PF
			eventGroupInfoPtr->event_wrt_ptr=mytmprdata.tamper_events4_wrt_ptr;
			eventGroupInfoPtr->base_address=EVENTS4_BASE_ADDRESS;
			eventGroupInfoPtr->end_address=EVENTS4_END_ADDRESS;
			eventGroupInfoPtr->whichGroup=4;
			retval=1;	// ok
			break;
			
		case 26:	//	COVER_OPEN
			eventGroupInfoPtr->event_wrt_ptr=mytmprdata.tamper_events5_wrt_ptr;
			eventGroupInfoPtr->base_address=EVENTS5_BASE_ADDRESS;
			eventGroupInfoPtr->end_address=EVENTS5_END_ADDRESS;
			eventGroupInfoPtr->whichGroup=5;
			retval=0;	// error
			break;
	}
	return retval;
}

