Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/display&button/lcd/em_display_TN3P_Helper.c
// The function display_unrestored_tamper_date will read the event records of the group
// and once it identifies the unrestored tamper record matching the event_code_bit, it will
// retrieve the date and time of that record and display it
void display_unrestored_tamper_date(uint8_t event_code_bit)
{
	eventGroupInfo_t eventGroupInfo;
	ext_rtc_t recordDtTm;
	uint32_t address;
	uint32_t terminalAddress;
	uint8_t retval;
	uint8_t eventCodeBit;
	uint8_t done;
	uint8_t success;
	
	retval = getEventGroupInfo(&eventGroupInfo, event_code_bit);
	if(retval==0)
	{// this is an error condition - probably a wrong event code bit has been sent
	
	}
	else
	{// here we are good to go
	// the  objective is to find the unrestored occurence record of this event_code_bit
	// if no overflow has occured, we must search backwards till the base_addr
	// if overflow has occured, we must stop search once we read the startAddress which is the wrt_ptr
		if((mytmprdata.tamperEvent_overflow&_BV(eventGroupInfo.whichGroup))==0)
			terminalAddress=eventGroupInfo.base_address;
		else
			terminalAddress = eventGroupInfo.event_wrt_ptr;

		done = 0;
		success = 0;
		address = eventGroupInfo.event_wrt_ptr;
		decptr_maskless(&address, eventGroupInfo.base_address, eventGroupInfo.end_address, EVENT_PTR_INC); // begin with the previous record which is the newest record
		do
		{// we are looking for the unrestored occurence record which has the same event_code_bit as this restoration case
			EPR_Read((address+(uint32_t)EVENT_CODE_OFFSET), &eventCodeBit, sizeof(eventCodeBit));

			if(event_code_bit==eventCodeBit)
			{// we got the record which has the event code bit we are looking for
				// we should check if this record is restored or not - since this is the earliest encountered
				// occurence record, it must be the one which has not been restored
				// if for some reason it has been restored then it may be an error - let us be safe
				EPR_Read((address+(uint32_t)(EVENT_PTR_INC/2)), (uint8_t*)&recordDtTm, sizeof(recordDtTm));
				if((recordDtTm.date==0)&&(recordDtTm.month==0)&&(recordDtTm.year==0))
				{// this record is has not been restored - this is the one we wanted
				// now read the occurence datetime
					EPR_Read(address, (uint8_t*)&recordDtTm, sizeof(recordDtTm));
					done=1;// job is done
					success = 1;
				}
			}
// here either event_code does not match or the record is already restored or done is 1					 
			if(done==0)
			{
				if(address==terminalAddress)
				{
					done = 1;	// we were unsuccesful in finding a matching record
					success = 0;
				}
				else
				{// continue the search in the ulta direction
					decptr_maskless(&address, eventGroupInfo.base_address, eventGroupInfo.end_address, EVENT_PTR_INC);
				}
			}
		}
		while(done == 0);
		
		if(success==0)
		{// we could not find an unrestored record - highly unusual - some mistake
		
		}
		else
		{
			lcd_display_date(recordDtTm.date, recordDtTm.month, recordDtTm.year);
		}
	}
}


void display_unrestored_tamper_time(uint8_t event_code_bit)
{
	eventGroupInfo_t eventGroupInfo;
	ext_rtc_t recordDtTm;
	uint32_t address;
	uint32_t terminalAddress;
	uint8_t retval;
	uint8_t eventCodeBit;
	uint8_t done;
	uint8_t success;

	retval = getEventGroupInfo(&eventGroupInfo, event_code_bit);
	if(retval==0)
	{// this is an error condition - probably a wrong event code bit has been sent
	
	}
	else
	{// here we are good to go
	// the  objective is to find the unrestored occurence record of this event_code_bit
	// if no overflow has occured, we must search backwards till the base_addr
	// if overflow has occured, we must stop search once we read the startAddress which is the wrt_ptr
		if((mytmprdata.tamperEvent_overflow&_BV(eventGroupInfo.whichGroup))==0)
			terminalAddress=eventGroupInfo.base_address;
		else
			terminalAddress = eventGroupInfo.event_wrt_ptr;

		done = 0;
		address = eventGroupInfo.event_wrt_ptr;
		decptr_maskless(&address, eventGroupInfo.base_address, eventGroupInfo.end_address, EVENT_PTR_INC); // begin with the previous record which is the newest record
		do
		{// we are looking for the unrestored occurence record which has the same event_code_bit as this restoration case
			EPR_Read((address+(uint32_t)EVENT_CODE_OFFSET), &eventCodeBit, sizeof(eventCodeBit));

			if(event_code_bit==eventCodeBit)
			{// we got the record which has the event code bit we are looking for
				// we should check if this record is restored or not - since this is the earliest encountered
				// occurence record, it must be the one which has not been restored
				// if for some reason it has been restored then it may be an error - let us be safe
				EPR_Read((address+(uint32_t)(EVENT_PTR_INC/2)), (uint8_t*)&recordDtTm, sizeof(recordDtTm));
				if((recordDtTm.date==0)&&(recordDtTm.month==0)&&(recordDtTm.year==0))
				{// this record is has not been restored - this is the one we wanted
				// now read the occurence datetime
					EPR_Read(address, (uint8_t*)&recordDtTm, sizeof(recordDtTm));
					done=1;// job is done
					success = 1;
				}
			}
// here either event_code does not match or the record is already restored or done is 1					 
			if(done==0)
			{
				if(address==terminalAddress)
				{
					done = 1;	// we were unsuccesful in finding a matching record
					success = 0;
				}
				else
				{// continue the search in the ulta direction
					decptr_maskless(&address, eventGroupInfo.base_address, eventGroupInfo.end_address, EVENT_PTR_INC);
				}
			}
		}
		while(done == 0);
		
		if(success==0)
		{// we could not find an unrestored record - highly unusual - some mistake
		
		}
		else
		{
			lcd_display_time(recordDtTm.hour, recordDtTm.minute, recordDtTm.second);
		}
	}
}
#endif

void display_specific_tamper(uint8_t eventcodebit)
{
	switch(eventcodebit)
	{
		case 0:	//	No Tamper
			lcd_msg((const uint8_t*)&msg_nil_tamper);
			break;
		
		case 1:	//	MISSING_POTENTIAL_R
			lcd_msg((const uint8_t*)&voltage_fail_tamper);
			LCD_DisplayDigit(1, LCD_CHAR_R);
			break;
			
		case 2:	//	MISSING_POTENTIAL_Y
			lcd_msg((const uint8_t*)&voltage_fail_tamper);
			LCD_DisplayDigit(1, LCD_CHAR_Y);
			break;
			
		case 3:	//	MISSING_POTENTIAL_B
			lcd_msg((const uint8_t*)&voltage_fail_tamper);
			LCD_DisplayDigit(1, LCD_CHAR_B);
			break;
			
		case 4:	//	OVER_VOLTAGE
			lcd_msg((const uint8_t*)&msg_hv_tamper);
			break;
		
		case 5:	//	UNDER_VOLTAGE
			lcd_msg((const uint8_t*)&msg_lv_tamper);
			break;
			
		case 6:	//	VOLTAGE_UNBALANCED
			lcd_msg((const uint8_t*)&voltage_unbalance_tamper);
			break;
			
		case 7:	//	CT_REVERSED_R
			lcd_msg((const uint8_t*)&current_reverse_tamper);
			LCD_DisplayDigit(1, LCD_CHAR_R);
			break;
		
		case 8:	//	CT_REVERSED_Y
			lcd_msg((const uint8_t*)&current_reverse_tamper);
			LCD_DisplayDigit(1, LCD_CHAR_Y);
			break;
		
		case 9:	//	CT_REVERSED_B
			lcd_msg((const uint8_t*)&current_reverse_tamper);
			LCD_DisplayDigit(1, LCD_CHAR_B);
			break;
		
		case 10:	//	CT_OPEN_R
			lcd_msg((const uint8_t*)&current_fail_tamper);
			LCD_DisplayDigit(1, LCD_CHAR_R);
			break;

		case 11:	//	CT_OPEN_Y
			lcd_msg((const uint8_t*)&current_fail_tamper);
			LCD_DisplayDigit(1, LCD_CHAR_Y);
			break;
		
		case 12:	//	CT_OPEN_B
			lcd_msg((const uint8_t*)&current_fail_tamper);
			LCD_DisplayDigit(1, LCD_CHAR_B);
			break;
		
		case 13:	//	CURRENT_UNBALANCED
			lcd_msg((const uint8_t*)&current_unbalance_tamper);
			break;
		
