Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/display&button/lcd/em_display_TN3P_Helper.c
		case 14:	//	CT_BYPASS
			lcd_msg((const uint8_t*)&current_bypass_tamper);
			break;
		
		case 15:	//	OVER_CURRENT_R
			lcd_msg((const uint8_t*)&over_current_tamper);
			LCD_DisplayDigit(1, LCD_CHAR_R);
			break;

		case 22:	//	MAGNET
		case 23:	//	AC_MAGNET
			lcd_msg((const uint8_t*)&magnet_indication_tamper);
			break;

		case 24:	//	NEUTRAL_DISTURBANCE
			lcd_msg((const uint8_t*)&neutral_disturbance_tamper);
			break;
		
		case 29:	//	OVER_CURRENT_Y
			lcd_msg((const uint8_t*)&over_current_tamper);
			LCD_DisplayDigit(1, LCD_CHAR_Y);
			break;
		
		case 30:	//	OVER_CURRENT_B
			lcd_msg((const uint8_t*)&over_current_tamper);
			LCD_DisplayDigit(1, LCD_CHAR_B);
			break;
				
		default:
			break;
	}
}

/*
	once d_Tampers function is called - it will prevent disp_state from being incremented till
	all steps have been completed - Pressing the forward key/multiple calls will cause the steps to be executed
	turn by turn till the last step is reached
	Pressing the Back key will cause exit from the function altogether
*/
uint32_t gTamperEvent;
uint8_t g_tamper_display_state;
uint8_t g_cover_display_state;
uint8_t cover_disp_timer;

//	g_tamper_display_state = 0;
// This variable must be made zero whenever we enter Mode I

// the function d_Tampers only displays unrestored tampers
void d_Tampers(void)
{
	uint32_t whichevent;
	uint8_t event_code_bit;
	uint8_t whichGroup;

	if(g_display_flag.holdState==0)
	{
		gTamperEvent = mytmprdata.tamperEvent_image&TAMPER_DISPLAY_MASK; // make all those bits not to be displayed as 0
		g_display_flag.holdState = 1;
		g_tamper_display_state = 0;	// safety
	}
	
	switch(g_tamper_display_state)
	{
		case 0:
			if(gTamperEvent==0)
			{// hereg_display_flag there are no tampers
				display_specific_tamper(0);	// 0 is to display the no tamper message
			}
			else
			{// here there is some tamper present i.e. some bits are 1
			// only those bits which are to be displayed have not been masked, transaction events and cover open etc have been masked out
		    whichevent = gTamperEvent & ~(gTamperEvent-1);
				event_code_bit=findWhichBitIsOne(whichevent);	// bit numbers 1 to 15, 22, 23, 24, 29 and 30  - bit 0 is not used, others masked out
				
				display_specific_tamper(event_code_bit);
			}
//			g_tamper_display_state++;
			break;

		case 1:
			if(gTamperEvent==0)
			{// hereg_display_flag there are no tampers
				lcd_display_date(0,0,0);		// this will display 00:00:00
			}
			else
			{// here there is some tamper present
		    whichevent = gTamperEvent & ~(gTamperEvent-1);
				event_code_bit=findWhichBitIsOne(whichevent);	// bit number 1 to 30 (31 max) - bit 0 is not used
				display_unrestored_tamper_date(event_code_bit);
			}
//			g_tamper_display_state++;
			break;

		case 2:
			if(gTamperEvent==0)
			{// hereg_display_flag there are no tampers
				lcd_display_time(0,0,0);		// this will display 00:00:00
			}
			else
			{// here there is some tamper present
		    whichevent = gTamperEvent & ~(gTamperEvent-1);
				event_code_bit=findWhichBitIsOne(whichevent);	// bit number 1 to 30 (31 max) - bit 0 is not used
				display_unrestored_tamper_time(event_code_bit);
				gTamperEvent&=~whichevent;	// job complete for this fellow
			}
			
			if(gTamperEvent==0)
			{// everything has been completed
				g_display_flag.holdState=0; 	// allow disp_state to be incremented
			}
			g_tamper_display_state = 0;	// get ready for next time around
			break;
	}
}

void d_Last_Restored_Tamper(void)
{
// this is also a three state function, and will set the holdState flag
// releasing it once the time has been displayed
	if(g_display_flag.holdState==0)
	{
		g_display_flag.holdState = 1;
		g_tamper_display_state = 0;	// safety
	}
	
	switch(g_tamper_display_state)
	{
		case 0:
			display_specific_tamper(mytmprdata.latestTamperCode);	// latestTamperCode contains the permitted eventCodeBit
//			g_tamper_display_state++;
			break;

		case 1:
			lcd_display_date(mytmprdata.latestTamperDateTime.date, mytmprdata.latestTamperDateTime.month, mytmprdata.latestTamperDateTime.year);
//			g_tamper_display_state++;
			break;

		case 2:
			lcd_display_time(mytmprdata.latestTamperDateTime.hour, mytmprdata.latestTamperDateTime.minute, mytmprdata.latestTamperDateTime.second);
//			g_tamper_display_state++;
			g_display_flag.holdState=0; 	// allow disp_state to be incremented
			g_tamper_display_state = 0;	// get ready for next time around
			break;
	}
}

void d_Tamper_Count(void)
{// display the cumulative tamper count
	LCD_DisplayIntWithPos(mytmprdata.tamperCount, LCD_LAST_POS_DIGIT);
	LCD_DisplayDigit(9, LCD_CHAR_T);
	LCD_DisplayDigit(8, LCD_CHAR_C);
  LCD_DisplaySpSign(S_T8);	// CUM Sign
}

void d_Magnet_Tamper_Indication(void)
{
//	if((g_TamperStatus&HALLSENS_MASK)==0)
	if((mytmprdata.tamperEvent_once&MAGNET_MASK)==0)
	{// there was never any magnet tamper
		lcd_msg((const uint8_t*)&magnet_tamper_nil);
	}
	else
	{// there is magnet tamper at least once
		lcd_msg((const uint8_t*)&magnet_tamper_yes);
	}
}


void displayEnergy(int32_t energy, uint8_t whichEnergy)
{
  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
	display_long_one_dp(energy/100);
	
	switch(whichEnergy)
	{
		case BILL_KWH_ENERGY:
			LCD_DisplaykWhSign();
			break;
			
		case BILL_KVAH_ENERGY:
			LCD_DisplaykVAhSign();
			break;
			
		case BILL_KVARH_LAG_ENERGY:
		case BILL_KVARH_LEAD_ENERGY:
		case BILL_KVARH_TOTAL_ENERGY:
			LCD_DisplaykVArhSign();
			break;
			
	}
}

int32_t getCumMD_uptillNow(uint8_t imp_ex_type, uint8_t mdType)
{
	uint32_t baseAddr;
	uint32_t addr;
	uint32_t offset;
	int32_t cumMD;
	uint8_t tmonth;
	
	if(imp_ex_type==IMPORT)
	{
		baseAddr = BILLDATA_BASE_ADDRESS;
		if(mdType==BILL_MD_KW)
		{
			offset = 404;
		}
		else
		{
			offset = 408;
		}
	}
	else
	{
		baseAddr = BILLDATA_EXPORT_BASE_ADDRESS;
		if(mdType==BILL_MD_KW)
		{
			offset = 412;
		}
		else
		{
			offset = 416;
		}
	}

	if(Common_Data.bpcount==0)
	{
		cumMD = 0;
	}
	else
	{// some bills have been made
		tmonth = decrementMonth(1);
		addr=baseAddr + (tmonth-1)*BILL_PTR_INC + offset;
		EPR_Read(addr, (uint8_t*)&cumMD, 4);	// read 4 bytes of appropriate CumMD
	}
	return cumMD;
}

int32_t getCurrentTOD_KWH(uint8_t imp_ex_type, uint8_t zone)
{
// zone goes from 0,1,2,3,4,5 - these are our registers
	int32_t tempTodKwh;
	int32_t currentZoneValue;
	uint32_t offset;
		
