Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/display&button/lcd/em_display_TN3P_Helper.c
	if(imp_ex_type==IMPORT)
	{
		offset = 0;
		currentZoneValue = myenergydata.zone_kwh;
	}
	else
	{
		offset = 36;
		currentZoneValue = myenergydata.zone_kwh_export;
	}
	
	EPR_Read(TOD_CURRENT_BASE_ADDRESS+zone*ZONE_PTR_INC+offset, (uint8_t*)&tempTodKwh, sizeof(tempTodKwh));
	
	if(zone==presentZone)
	{
		tempTodKwh+=currentZoneValue;
	}
	return tempTodKwh;
}

int32_t getBillingTOD_KWH(uint8_t imp_ex_type, uint8_t whichBill, uint8_t zone)
{
// zone goes from 0,1,2,3,4,5 - these are our registers
	int32_t tempTodKwh;
	uint32_t addr;
	uint32_t offset;
	uint8_t tmonth;
	
	if(whichBill>Common_Data.bpcount)
		return 0;
		
	tmonth = decrementMonth(whichBill);
	
	if(imp_ex_type==IMPORT)
	{
		addr = BILLDATA_BASE_ADDRESS;
		offset = 12;
	}
	else
	{
		addr = BILLDATA_EXPORT_BASE_ADDRESS;
		offset = 12;
	}
	
  tmonth = decrementMonth(whichBill);
  EPR_Read(BILLDATA_BASE_ADDRESS+(tmonth-1)*BILL_PTR_INC + offset + (zone*4),(uint8_t*)&tempTodKwh,sizeof(tempTodKwh));
	
	return tempTodKwh;
}

void display_CumKWH_TOD(uint8_t imp_ex_type, uint8_t index)
{// this displays current TOD
// index for TN is 1,2,3,4,5
// pvk zone definitions are 0,1,2,3,4,5
// relation between index and zone is as follows
/*
Index			Zone
	1					1
	2					3
	3					4
	4					0 + 2
	5					5
*/

	int32_t todEnergy;
	
	switch(index)
	{
		case 1:
			todEnergy = getCurrentTOD_KWH(imp_ex_type,1);
			break;
			
		case 2:
			todEnergy = getCurrentTOD_KWH(imp_ex_type,3);
			break;
	
		case 3:
			todEnergy = getCurrentTOD_KWH(imp_ex_type,4);
			break;
			
		case 4:
			todEnergy = getCurrentTOD_KWH(imp_ex_type,0);
			todEnergy+= getCurrentTOD_KWH(imp_ex_type,2);
			break;
			
		case 5:
			todEnergy = getCurrentTOD_KWH(imp_ex_type,5);
			break;

		default:
			todEnergy=0;
			break;
			
	}

	displayEnergy(todEnergy, BILL_KWH_ENERGY);
  LCD_DisplaySpSign(S_TOD);
  LCD_DisplaySpSign(S_T8);	// Cum
	
	if(imp_ex_type==EXPORT)
		LCD_DisplaySpSign(S_EXPORT);
	else
		LCD_DisplaySpSign(S_IMPORT);	
		
	LCD_DisplayDigit(8, index);
}

void displayBabyDigits_IE(uint8_t imp_ex_type)
{// now we have IMPORT and EXPORT icons
	if(imp_ex_type==EXPORT)
  	LCD_DisplaySpSign(S_EXPORT);
	else
  	LCD_DisplaySpSign(S_IMPORT);
}

void display_CumKWH(uint8_t imp_ex_type)
{
	int32_t energy;
	if(imp_ex_type==IMPORT)
		energy = myenergydata.kwh;
	else
		energy = myenergydata.kwh_export;
	
	displayEnergy(energy, BILL_KWH_ENERGY);
	
  LCD_DisplaySpSign(S_T8);	// CUM Sign
	
	displayBabyDigits_IE(imp_ex_type);
	disp_autoscroll_interval=20;
}

void display_CumKVAH(uint8_t imp_ex_type)
{
	int32_t energy;
	if(imp_ex_type==IMPORT)
		energy = myenergydata.kvah;
	else
		energy = myenergydata.kvah_export;
	
	displayEnergy(energy, BILL_KVAH_ENERGY);
  LCD_DisplaySpSign(S_T8);	// CUM Sign
	displayBabyDigits_IE(imp_ex_type);
}

void display_CumKVARH(uint8_t imp_ex_type, uint8_t lgld)
{
	int32_t energy;
	uint8_t lgldType;
	if(imp_ex_type==IMPORT)
	{
		if(lgld==D_LAG)
		{
			energy = myenergydata.kvarh_lag;
			lgldType = BILL_KVARH_LAG_ENERGY;
		}
		else if(lgld==D_LEAD)
		{
			energy = myenergydata.kvarh_lead;
			lgldType = BILL_KVARH_LEAD_ENERGY;
		}
		else
		{
			energy = myenergydata.kvarh_lag+myenergydata.kvarh_lead;
			lgldType = BILL_KVARH_TOTAL_ENERGY;
		}
	}
	else
	{
		if(lgld==D_LAG)
		{
			energy = myenergydata.kvarh_lag_export;
			lgldType = BILL_KVARH_LAG_ENERGY;
		}
		else if(lgld==D_LEAD)
		{
			energy = myenergydata.kvarh_lead_export;
			lgldType = BILL_KVARH_LEAD_ENERGY;
		}
		else
		{
			energy = myenergydata.kvarh_lag_export+myenergydata.kvarh_lead_export;
			lgldType = BILL_KVARH_TOTAL_ENERGY;
		}
	}

	displayEnergy(energy, lgldType);
	
  LCD_DisplaySpSign(S_T8);	// CUM Sign
// what about Lag / Lead differentiation	

	if(imp_ex_type==EXPORT)
  	LCD_DisplaySpSign(S_EXPORT);
	else
  	LCD_DisplaySpSign(S_IMPORT);
		
	if(lgld==D_LAG)
  	LCD_DisplaySpSign(S_LAG);
	else
  	LCD_DisplaySpSign(S_LEAD);
}

void display_Current_AVG_PF(uint8_t imp_ex_type)
{
	int32_t tempLong;
	int32_t tempLong1;
	int32_t tempLong2;
	int32_t currentKWH;
	int32_t currentKVAH;
	
	if(imp_ex_type==IMPORT)
	{
		currentKWH=myenergydata.kwh;
		currentKVAH=myenergydata.kvah;
	}
	else
	{
		currentKWH=myenergydata.kwh_export;
		currentKVAH=myenergydata.kvah_export;
	}
	
	if(Common_Data.bpcount==0)
	{// no bills have been made
		tempLong = (currentKWH*1000)/currentKVAH;
	}
	else
	{//read last months kwh and kvah
		tempLong1 = get_Energy_Billing(imp_ex_type, 1, BILL_KWH_ENERGY);
		tempLong2 = get_Energy_Billing(imp_ex_type, 1, BILL_KVAH_ENERGY);
		if(currentKVAH>tempLong2)
			tempLong = ((currentKWH-tempLong1)*1000)/(currentKVAH - tempLong2);
		else
			tempLong=0;
	}
	display_long_three_dp(tempLong);
	lcd_display_A();	

	LCD_DisplayDigit(1, LCD_CHAR_P);
	LCD_DisplayDigit(2, LCD_CHAR_F);

	if(imp_ex_type==EXPORT)
  	LCD_DisplaySpSign(S_EXPORT);
	else
  	LCD_DisplaySpSign(S_IMPORT);
}


void display_Billing_AVG_PF(uint8_t imp_ex_type, uint8_t whichBill)
{
//now the bills store the correct value for average pf - hence we need to only display the value
	uint32_t addr;
	uint32_t offset;
	int32_t bill_avgPF;
	uint8_t tmonth;

	if(imp_ex_type==IMPORT)
		addr = BILLDATA_BASE_ADDRESS;
	else
		addr = BILLDATA_EXPORT_BASE_ADDRESS;

	offset = 296;	// this is the offset for average pf (power_factor)
		
	if((whichBill>Common_Data.bpcount)||(whichBill==255))
	{// whichBill can be 1 to 12
		bill_avgPF=0;	//this bill not yet made
	}
	else	
	{
	  tmonth = decrementMonth(whichBill);
	  EPR_Read(addr+(tmonth-1)*BILL_PTR_INC+offset,(uint8_t*)&bill_avgPF,sizeof(bill_avgPF));
	}

	display_long_three_dp(bill_avgPF);
	lcd_display_A();
	LCD_DisplayDigit(9, whichBill);
  LCD_DisplayDigit(1, LCD_CHAR_P);
  LCD_DisplayDigit(2, LCD_CHAR_F);
  LCD_DisplaySpSign(S_BILL);
	
	if(imp_ex_type==EXPORT)
  	LCD_DisplaySpSign(S_EXPORT);
	else
  	LCD_DisplaySpSign(S_IMPORT);	
}

void displayMD(uint16_t md, uint8_t mdtype, uint8_t imp_ex_type, uint8_t whichBill)
{
	display_long_three_dp(md);
	if(mdtype==0)
		LCD_DisplaykWSign();
	else
		LCD_DisplaykVASign();
	
