Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/display&button/lcd/em_display_TN3P_Helper.c
  LCD_DisplaySpSign(S_MD);
	
	if(whichBill!=0)
		LCD_DisplayDigit(9, whichBill);
	
	if(imp_ex_type!=IMPORT)
		LCD_DisplaySpSign(S_EXPORT);
	else
		LCD_DisplaySpSign(S_IMPORT);
}

void display_MD_Current(uint8_t imp_ex_type)
{
	uint16_t md;
	if(imp_ex_type==IMPORT)
	{
		if(Common_Data.mdType==MDKW)
			md = mymddata.mdkw;
		else
			md = mymddata.mdkva;
	}
	else
	{
		if(Common_Data.mdType==MDKW)
			md = mymddata.mdkw_export;
		else
			md = mymddata.mdkva_export;
	}
	displayMD(md, Common_Data.mdType, imp_ex_type,0);
}

uint16_t get_MD_Billing(uint8_t imp_ex_type, uint8_t whichBill)
{// for TNEB there is only MD - KW or KVA depends on Common_Data.mdtype
	uint32_t addr;
	uint32_t offset;
	uint16_t tempInt;
	uint8_t tmonth;

	if(imp_ex_type==IMPORT)
		addr = BILLDATA_BASE_ADDRESS;
	else
		addr = BILLDATA_EXPORT_BASE_ADDRESS;
	
	if(Common_Data.mdType==MDKW)
		offset=80;
	else
		offset=188;
		
	if(whichBill>Common_Data.bpcount)
		tempInt=0;	// bill not made yet
	else
	{	
	  tmonth = decrementMonth(whichBill);
	  EPR_Read(addr+(tmonth-1)*BILL_PTR_INC+offset,(uint8_t*)&tempInt,2);
	}
	
	return tempInt;
}

ext_rtc_t get_MD_BillingDateTime(uint8_t imp_ex_type, uint8_t whichBill, uint8_t mdtype)
{// whichBill = 1 (L1) in this case
	ext_rtc_t tdate;
	uint32_t addr;
	uint32_t offset;
	uint8_t tmonth;

	if(imp_ex_type==IMPORT)
		addr = BILLDATA_BASE_ADDRESS;
	else
		addr = BILLDATA_EXPORT_BASE_ADDRESS;
	
	if(mdtype==MDKW)
		offset=84;
	else
		offset=192;
		
	if(whichBill>Common_Data.bpcount)
	{
		tdate.date=0;	// bill not made yet
		tdate.month=0;
		tdate.year=0;
		tdate.hour=0;
		tdate.minute=0;
		tdate.second=0;
	}
	else
	{	
	  tmonth = decrementMonth(whichBill);
	  EPR_Read(addr+(tmonth-1)*BILL_PTR_INC+offset,(uint8_t*)&tdate,sizeof(tdate));
	}
	return tdate;
}

void display_MD_Billing(uint8_t imp_ex_type, uint8_t whichBill)
{// whichBill = 1 (L1), 2(L2) etc upto 12(L12)
	uint16_t md;
	md=get_MD_Billing(imp_ex_type, whichBill);
	displayMD(md, Common_Data.mdType, imp_ex_type, whichBill);
	LCD_DisplaySpSign(S_BILL);	
}

void display_MD_BillingDateTime_L1(uint8_t imp_ex_type, uint8_t dtOrTm)
{
// date/time of current MD or L1 MD whichever is higher is to be shown 
	ext_rtc_t tdate;
	uint16_t mdBill;
	uint16_t mdCurrent;
	
	if(Common_Data.mdType==MDKW)
	{
		if(imp_ex_type==IMPORT)
			mdCurrent=mymddata.mdkw;
		else
			mdCurrent=mymddata.mdkw_export;
	}
	else
	{
		if(imp_ex_type==IMPORT)
			mdCurrent=mymddata.mdkva;
		else
			mdCurrent=mymddata.mdkva_export;
	}
	
	mdBill=get_MD_Billing(imp_ex_type, 1);	// this will return mdkw or mdva - L1 assumed
	
	if(mdBill>mdCurrent)
	{
		tdate = get_MD_BillingDateTime(imp_ex_type, 1,Common_Data.mdType); // - L1 assumed
  	LCD_DisplaySpSign(S_BILL);	
// gaurav		
	}
	else
	{
		if(Common_Data.mdType==MDKW)
		{
			if(imp_ex_type==IMPORT)
				tdate = mymddata.mdkw_datetime;
			else
				tdate = mymddata.mdkw_datetime_export;
		}
		else
		{
			if(imp_ex_type==IMPORT)
				tdate = mymddata.mdkva_datetime;
			else
				tdate = mymddata.mdkva_datetime_export;
		}
	}
	if(dtOrTm==MDDATE)
		lcd_display_date(tdate.date,tdate.month,tdate.year);
	else
		lcd_display_time(tdate.hour,tdate.minute,tdate.second);

  LCD_DisplaySpSign(S_MD);
	
	if(Common_Data.mdType==MDKW)
		LCD_DisplaykWSign();
	else
		LCD_DisplaykVASign();
		
	if(imp_ex_type==EXPORT)
		LCD_DisplaySpSign(S_EXPORT);
	else
		LCD_DisplaySpSign(S_IMPORT);	
}

void d_LastBillDate(void)
{
	int16_t year;
	if (Common_Data.bpcount==0)
		year = 0;
	else
		year = ((g_Class03_BillingDate.year_high*256) + g_Class03_BillingDate.year_low) - 2000;
	lcd_display_date(g_Class03_BillingDate.day_of_month,g_Class03_BillingDate.month,year);
}

void d_LastBillTime(void)
{
	lcd_display_time(g_Class03_BillingDate.hour,g_Class03_BillingDate.minute,g_Class03_BillingDate.second);
}

int32_t get_Energy_Billing(uint8_t imp_ex_type, uint8_t whichBill, uint8_t whichEnergy)
{
// this function gets energy from bills stored in e2rom
	uint32_t addr;
	uint32_t offset;
	int32_t tempLong;
	uint8_t tmonth;

	if(imp_ex_type==IMPORT)
		addr = BILLDATA_BASE_ADDRESS;
	else
		addr = BILLDATA_EXPORT_BASE_ADDRESS;
	
	switch(whichEnergy)
	{
		case BILL_KWH_ENERGY:
			offset = 8;
			break;
			
		case BILL_KVAH_ENERGY:
			offset = 44;
			break;
			
		case BILL_KVARH_LAG_ENERGY:
			offset = 332;
			break;
			
		case BILL_KVARH_LEAD_ENERGY:
			offset = 368;
			break;
			
		default:
			whichBill = 255;	// error
			break;
	}
		
		
	if((whichBill>Common_Data.bpcount)||(whichBill==255))
	{// whichBill can be 1 to 12
		tempLong=0;	//this bill not yet made
	}
	else	
	{
	  tmonth = decrementMonth(whichBill);
	  EPR_Read(addr+(tmonth-1)*BILL_PTR_INC+offset,(uint8_t*)&tempLong,sizeof(tempLong));
	}
	return tempLong;
}


void display_Energy_Billing(uint8_t imp_ex_type, uint8_t whichBill, uint8_t whichEnergy)
{
	int32_t energy;
	energy = get_Energy_Billing(imp_ex_type, whichBill, whichEnergy);
	
	displayEnergy(energy, whichEnergy);
	
  LCD_DisplaySpSign(S_BILL);
  LCD_DisplaySpSign(S_T8);	// Cum
	
// display LwhichBill, L1,L2 etc
//	LCD_DisplayDigit(9, LCD_CHAR_L);
	LCD_DisplayDigit(9, whichBill);

// display Import/Export
	if(imp_ex_type==EXPORT)
		LCD_DisplaySpSign(S_EXPORT);
	else
		LCD_DisplaySpSign(S_IMPORT);	
}

int32_t get_Energy_Billing_TOD(uint8_t imp_ex_type, uint8_t whichBill, uint8_t whichZone, uint8_t whichEnergy)
{
// this function gets zone energies from the bills stored in e2rom
//whichZone goes from 0,1,2,3,4,5,6,7
	uint32_t addr;
	uint32_t offset;
	int32_t tempLong;
	uint8_t tmonth;

	if(imp_ex_type==IMPORT)
		addr = BILLDATA_BASE_ADDRESS;
	else
		addr = BILLDATA_EXPORT_BASE_ADDRESS;
	
	switch(whichEnergy)
	{
		case BILL_KWH_ENERGY:
			offset = 12+whichZone*4;
			break;
			
		case BILL_KVAH_ENERGY:
			offset = 48+whichZone*4;
			break;
			
		case BILL_KVARH_LAG_ENERGY:
			offset = 336+whichZone*4;
			break;
			
		case BILL_KVARH_LEAD_ENERGY:
			offset = 372+whichZone*4;
			break;
			
		default:
			whichBill = 255;	// error
			break;
	}
		
		
	if((whichBill>Common_Data.bpcount)||(whichBill==255))
	{// whichBill can be 1 to 12
		tempLong=0;	//this bill not yet made
	}
	else	
	{
	  tmonth = decrementMonth(whichBill);
	  EPR_Read(addr+(tmonth-1)*BILL_PTR_INC+offset,(uint8_t*)&tempLong,sizeof(tempLong));
	}
	return tempLong;

