Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/display&button/lcd/em_display_TN3P_Helper.c
}

void display_Energy_Billing_TOD(uint8_t imp_ex_type, uint8_t whichBill, uint8_t whichIndex, uint8_t whichEnergy)
{
// index for TNEB goes from 1,2,3,4,5
// we need to convert them to zones
	int32_t todEnergy;
	
	switch(whichIndex)
	{
		case 1:
			todEnergy = get_Energy_Billing_TOD(imp_ex_type,whichBill,1,whichEnergy);
			break;
			
		case 2:
			todEnergy = get_Energy_Billing_TOD(imp_ex_type,whichBill,3,whichEnergy);
			break;
	
		case 3:
			todEnergy = get_Energy_Billing_TOD(imp_ex_type,whichBill,4,whichEnergy);
			break;
			
		case 4:
			todEnergy = get_Energy_Billing_TOD(imp_ex_type,whichBill,0,whichEnergy);
			todEnergy+= get_Energy_Billing_TOD(imp_ex_type,whichBill,2,whichEnergy);
			break;
			
		case 5:
			todEnergy = get_Energy_Billing_TOD(imp_ex_type,whichBill,5,whichEnergy);
			break;

		default:
			todEnergy=0;
			break;
			
	}
	displayEnergy(todEnergy, whichEnergy);
  LCD_DisplaySpSign(S_BILL);
  LCD_DisplaySpSign(S_TOD);
  LCD_DisplaySpSign(S_T8);	// Cum
// now display the index
	LCD_DisplayDigit(9, whichBill);
	LCD_DisplayDigit(8, whichIndex);
	
	if(imp_ex_type==EXPORT)
		LCD_DisplaySpSign(S_EXPORT);
	else
		LCD_DisplaySpSign(S_IMPORT);	
}

void display_CumMD(uint8_t imp_ex_type)
{
	uint32_t baseAddr;
	uint32_t addr;
	uint32_t offset;
	int32_t cumMD;
	int32_t currentMD;
	uint8_t tmonth;
	
	if(imp_ex_type==IMPORT)
	{
		baseAddr = BILLDATA_BASE_ADDRESS;
		if(Common_Data.mdType==MDKW)
		{
			currentMD = mymddata.mdkw;
			offset = 404;
		}
		else
		{
			currentMD = mymddata.mdkva;
			offset = 408;
		}
	}
	else
	{
		baseAddr = BILLDATA_EXPORT_BASE_ADDRESS;
		if(Common_Data.mdType==MDKW)
		{
			currentMD = mymddata.mdkw_export;
			offset = 412;
		}
		else
		{
			currentMD = mymddata.mdkva_export;
			offset = 416;
		}
	}

// currentMD has already been obtained

	if(Common_Data.bpcount==0)
	{
		cumMD = 0;
	}
	else
	{// some bills have been made
		tmonth = decrementMonth(1);
		addr=baseAddr + (tmonth-1)*BILL_PTR_INC + offset;
		EPR_Read(addr, (uint8_t*)&cumMD, 4);	// read 4 bytes of appropriate CumMD
	}
	cumMD+=currentMD; // This is the final figure
//	displayMD(cumMD,Common_Data.mdType, imp_ex_type, 0);
	
	display_long_three_dp(cumMD);
	if(Common_Data.mdType==0)
		LCD_DisplaykWSign();
	else
		LCD_DisplaykVASign();
	
  LCD_DisplaySpSign(S_MD);
  LCD_DisplaySpSign(S_T8);	// CUM Sign	
	
	if(imp_ex_type==EXPORT)
		LCD_DisplaySpSign(S_EXPORT);
	else
		LCD_DisplaySpSign(S_IMPORT);	
}

void display_Vrms(EM_LINE line)
{
	int32_t tempLong;
	tempLong = getInstantaneousParams(IVOLTS,line)*100;
	display_long_two_dp(tempLong);
  LCD_DisplaySpSign(S_T2);	// V
	g_display_flag.fast_display_flag=1;
}

void display_Irms(EM_LINE line)
{
	int32_t tempLong;
	tempLong = getInstantaneousParams(ICURRENTS,line)*1000;
	display_long_three_dp(tempLong);
	if(exportMode!=0)
		LCD_DisplayDigit(1, LCD_MINUS_SIGN);
	lcd_display_A();
	g_display_flag.fast_display_flag=1;
}

// gaurav
void displayRisingDemand(uint8_t imp_ex_type)
{
	int32_t tempLong;
	uint8_t tempchar;
	
  tempchar=60/(int32_t)Common_Data.mdinterval;
	if(imp_ex_type==IMPORT)
		tempLong = ((myenergydata.kwh-ctldata.kwh_last_saved)*(int32_t)tempchar);
	else
		tempLong = ((myenergydata.kwh_export-ctldata.kwh_last_saved_export)*(int32_t)tempchar);
	
	if(tempLong<0)
		tempLong=0;
	display_long_three_dp(tempLong);	// rising MD
	LCD_DisplaykWSign();
  LCD_DisplaySpSign(S_MD);
  LCD_DisplaySpSign(S_TIME);
	
// we can also display the minutes elapsed
	tempchar = rtc.minute - ((rtc.minute/Common_Data.mdinterval)*Common_Data.mdinterval); 
	LCD_DisplayDigit(9, tempchar/10);
	LCD_DisplayDigit(8, tempchar%10);
	
	if(imp_ex_type==EXPORT)
  	LCD_DisplaySpSign(S_EXPORT);
	else
  	LCD_DisplaySpSign(S_IMPORT);	
		
	LCD_DisplayDigit(1, LCD_CHAR_R);
	LCD_DisplayDigit(2, LCD_CHAR_D);
	g_display_flag.fast_display_flag=1;
}

void displayActivePower(EM_LINE line)
{
	int32_t tempLong;
  powermgmt_mode_t power_mode;
	power_mode = POWERMGMT_GetMode();
	if (power_mode != POWERMGMT_MODE3)
		tempLong = (int32_t)(EM_GetActivePower(line));
	else
		tempLong=0;
	display_long_three_dp(tempLong);
//	if(exportMode!=0)
//		LCD_DisplayDigit(1, LCD_MINUS_SIGN);
	LCD_DisplaykWSign();
	g_display_flag.fast_display_flag=1;
}

void displayApparentPower(EM_LINE line)
{
	int32_t tempLong;
  powermgmt_mode_t power_mode;
	power_mode = POWERMGMT_GetMode();
	if (power_mode != POWERMGMT_MODE3)
		tempLong = (int32_t)(EM_GetApparentPower(line));
	else
		tempLong=0;
	display_long_three_dp(tempLong);
	LCD_DisplaykVASign();
	g_display_flag.fast_display_flag=1;
}

void display_Billing_PowerOff(uint8_t whichBill)
{
// this is the value for a particular month - both power on hours and power off hours are now being computed for each bill
// data at offset 420 contains the power on minutes for that month
// data at offset 432 contains the power off minutes for that month
// we need to know the bill date so that we can figure out the number of
// minutes in that month
	int32_t powerOffMinutes;
	int32_t totalMinutes;

// get the powerOnminutes from bills stored in e2rom
	ext_rtc_t bdate;
	uint32_t addr;
	uint32_t offset;
	int32_t tempLong;
	uint8_t tmonth;

	addr = BILLDATA_BASE_ADDRESS;
	offset = 432;	
		
	if(whichBill>Common_Data.bpcount)
	{// whichBill can be 1 to 12
		powerOffMinutes=-1;	// no data for this bill
	}
	else	
	{
	  tmonth = decrementMonth(whichBill);
	  EPR_Read(addr+(tmonth-1)*BILL_PTR_INC+offset,(uint8_t*)&powerOffMinutes,sizeof(powerOffMinutes));
	}
	
	LCD_DisplayIntWithPos((powerOffMinutes/60), LCD_LAST_POS_DIGIT);	// we need to display the hours
	LCD_DisplayDigit(1, 0);
	LCD_DisplayDigit(2, LCD_CHAR_F);
}

void display_PowerOff(uint8_t currOrCum)
{// poweroff values for current month can be calculated by calling computePowerOffDurn(bdate)
// 0 - current, 1 is Cumulative
// power off is shown in hours
	int32_t temp;
	
	temp = computePowerOffDurn(rtc);	// use the rtc for current value

	if(currOrCum!=0)
	{
		temp += Common_Data.cumPowerFailDuration;
	}
	
	LCD_DisplayIntWithPos((temp/60), LCD_LAST_POS_DIGIT);	// power off to be shown in hours
	LCD_DisplayDigit(1, LCD_CHAR_P);
	LCD_DisplayDigit(2, 0);
	LCD_DisplayDigit(3, LCD_CHAR_F);
  LCD_DisplaySpSign(S_T7); // h
}

//--------------------------------------------------------------------------------------
// - final top level functions these are to be called from the display.c file
// all these functions do not need any parameter to be passed


