Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/display&button/lcd/em_display_TN3P_Helper.c
// this function automatically gets called
void d_COPEN(void)
{
	ext_rtc_t tamperTime;
	if(g_display_flag.holdState==0)
	{
		g_display_flag.holdState=1;
		g_cover_display_state=0;
	}
	
	disp_timer = disp_autoscroll_interval; // we want this function to be called every second
	cover_disp_timer++;
	
	if(g_display_flag.tglbit==0)
	{
	  LCD_ClearAll();		// this will cause blinking every other second
	}
	else
	{	
		switch(g_cover_display_state)
		{
			case 0:
				LCD_DisplayDigit(2, LCD_CHAR_C);
				LCD_DisplayDigit(3, LCD_MINUS_SIGN);
				LCD_DisplayDigit(4, 0);
				LCD_DisplayDigit(5, LCD_CHAR_P);
				LCD_DisplayDigit(6, LCD_CHAR_E);
				LCD_DisplayDigit(7, LCD_CHAR_N);
				break;

			case 1: /*display date*/
				EPR_Read(EVENTS5_BASE_ADDRESS, (uint8_t*)&tamperTime, sizeof(tamperTime));
				lcd_display_date(tamperTime.date,tamperTime.month,tamperTime.year);
				break;

			case 2:	/*display time*/
				EPR_Read(EVENTS5_BASE_ADDRESS, (uint8_t*)&tamperTime, sizeof(tamperTime));
				lcd_display_time(tamperTime.hour,tamperTime.minute,tamperTime.second);
				break;
		}
	}
	
	if(cover_disp_timer>=6)
	{
		cover_disp_timer=0;
		g_cover_display_state++;
		if(g_cover_display_state>2)
			g_cover_display_state=0;
	}
}

void d_COMM_ON(void)
{
	LCD_ClearAll();	

	LCD_DisplayDigit(1, LCD_CHAR_C);
	LCD_DisplayDigit(2, 0);
	LCD_DisplayDigit(3, LCD_CHAR_M);
	LCD_DisplayDigit(4, LCD_CHAR_M);
	LCD_DisplayDigit(5, LCD_MINUS_SIGN);
	LCD_DisplayDigit(6, 0);
	LCD_DisplayDigit(7, LCD_CHAR_N);	
}

void d_DNLD(void)
{
	LCD_ClearAll();	

	LCD_DisplayDigit(2, LCD_CHAR_D);
	LCD_DisplayDigit(3, LCD_CHAR_N);
	LCD_DisplayDigit(4, LCD_CHAR_L);
	LCD_DisplayDigit(5, LCD_CHAR_D);
}

void d_PowerOff_Current(void)
{
	display_PowerOff(0);
}
void d_PowerOff_Cum(void)
{
	display_PowerOff(1);
  LCD_DisplaySpSign(S_T8);	// CUM Sign
}

void d_PowerOff_Bill_L2(void)
{
	display_Billing_PowerOff(2);	
  LCD_DisplaySpSign(S_T8);	// CUM Sign
  LCD_DisplaySpSign(S_BILL);
//	LCD_DisplayDigit(9, LCD_CHAR_L);
	LCD_DisplayDigit(8, 2);
}

void d_resetCount(void)
{
	LCD_DisplayIntWithPos(Common_Data.bpcount, LCD_LAST_POS_DIGIT);
	LCD_DisplayDigit(9, LCD_CHAR_P);
  LCD_DisplaySpSign(S_D1);	// this will convert the P to R
	LCD_DisplayDigit(8, LCD_CHAR_C);
  LCD_DisplaySpSign(S_T8);	// CUM Sign
}

// Bill energies Import
void d_CumKWH_L1_Import(void)
{
	display_Energy_Billing(IMPORT, 1, BILL_KWH_ENERGY); 
}
void d_CumKVAH_L1_Import(void)
{
	display_Energy_Billing(IMPORT, 1, BILL_KVAH_ENERGY);	
}
void d_AVGPF_L1_Import(void)
{
	display_Billing_AVG_PF(IMPORT, 1);	
}

void d_CumKWH_L2_Import(void)
{
	display_Energy_Billing(IMPORT, 2, BILL_KWH_ENERGY); 
//	LCD_DisplayDigit(8, LCD_CHAR_E);
	
}
void d_CumKVAH_L2_Import(void)
{
	display_Energy_Billing(IMPORT, 2, BILL_KVAH_ENERGY); 
}
void d_AVGPF_L2_Import(void)
{
	display_Billing_AVG_PF(IMPORT, 2);	
}

	
	
//Bill TOD energies Import
void d_CumKWH_TOD1_L1_Import(void)
{
	display_Energy_Billing_TOD(IMPORT,1, 1, BILL_KWH_ENERGY); 
}
void d_CumKWH_TOD2_L1_Import(void)
{
	display_Energy_Billing_TOD(IMPORT,1, 2, BILL_KWH_ENERGY); 
}
void d_CumKWH_TOD3_L1_Import(void)
{
	display_Energy_Billing_TOD(IMPORT,1, 3, BILL_KWH_ENERGY); 
}
void d_CumKWH_TOD4_L1_Import(void)
{
	display_Energy_Billing_TOD(IMPORT,1, 4, BILL_KWH_ENERGY); 
}
void d_CumKWH_TOD5_L1_Import(void)
{
	display_Energy_Billing_TOD(IMPORT,1, 5, BILL_KWH_ENERGY); 
}

// Bill L1 energies Export
void d_CumKWH_L1_Export(void)
{
	display_Energy_Billing(EXPORT, 1, BILL_KWH_ENERGY); 
}
void d_CumKVAH_L1_Export(void)
{
	display_Energy_Billing(EXPORT, 1, BILL_KVAH_ENERGY); 
}
void d_AVGPF_L1_Export(void)
{
	display_Billing_AVG_PF(EXPORT, 1);
//	LCD_DisplayDigit(8, LCD_CHAR_E);
}
void d_CumKWH_L2_Export(void)
{
	display_Energy_Billing(EXPORT, 2, BILL_KWH_ENERGY);
//	LCD_DisplayDigit(8, LCD_CHAR_E);

}
void d_CumKVAH_L2_Export(void)
{
	display_Energy_Billing(EXPORT, 2, BILL_KVAH_ENERGY); 
}
void d_AVGPF_L2_Export(void)
{
	display_Billing_AVG_PF(EXPORT, 2);
//	LCD_DisplayDigit(8, LCD_CHAR_E);
}

//Bill TOD energies Export
void d_CumKWH_TOD1_L1_Export(void)
{
	display_Energy_Billing_TOD(EXPORT,1, 1, BILL_KWH_ENERGY); 
}
void d_CumKWH_TOD2_L1_Export(void)
{
	display_Energy_Billing_TOD(EXPORT,1, 2, BILL_KWH_ENERGY); 
}
void d_CumKWH_TOD3_L1_Export(void)
{
	display_Energy_Billing_TOD(EXPORT,1, 3, BILL_KWH_ENERGY); 
}
void d_CumKWH_TOD4_L1_Export(void)
{
	display_Energy_Billing_TOD(EXPORT,1, 4, BILL_KWH_ENERGY); 
}
void d_CumKWH_TOD5_L1_Export(void)
{
	display_Energy_Billing_TOD(EXPORT,1, 5, BILL_KWH_ENERGY); 
}


// Current TOD Energies Import
void d_CumKWH_TOD1_Import(void)
{
	display_CumKWH_TOD(IMPORT,1);	
}
void d_CumKWH_TOD2_Import(void)
{
	display_CumKWH_TOD(IMPORT,2);	
}
void d_CumKWH_TOD3_Import(void)
{
	display_CumKWH_TOD(IMPORT,3);	
}
void d_CumKWH_TOD4_Import(void)
{
	display_CumKWH_TOD(IMPORT,4);	
}
void d_CumKWH_TOD5_Import(void)
{
	display_CumKWH_TOD(IMPORT,5);	
}
// Current TOD Energies Export
void d_CumKWH_TOD1_Export(void)
{
	display_CumKWH_TOD(EXPORT,1);	
}
void d_CumKWH_TOD2_Export(void)
{
	display_CumKWH_TOD(EXPORT,2);	
}
void d_CumKWH_TOD3_Export(void)
{
	display_CumKWH_TOD(EXPORT,3);	
}
void d_CumKWH_TOD4_Export(void)
{
	display_CumKWH_TOD(EXPORT,4);	
}
void d_CumKWH_TOD5_Export(void)
{
	display_CumKWH_TOD(EXPORT,5);	
}


void d_netCumKWH(void)
{
	int32_t diff;
	diff = (myenergydata.kwh -myenergydata.kwh_export);
	if(diff<0)
		diff=diff*-1;
		
	displayEnergy(diff, BILL_KWH_ENERGY);
  LCD_DisplaySpSign(S_T8);	// CUM Sign
// what about the Net symbol	
	LCD_DisplayDigit(9, LCD_CHAR_N);
	LCD_DisplayDigit(8, LCD_CHAR_E);
	
	if(myenergydata.kwh<myenergydata.kwh_export)
		LCD_DisplayDigit(1, LCD_MINUS_SIGN);
}

// Current Energies & Average pF Import
void d_CumKWH_Import(void)
{
	display_CumKWH(IMPORT);
}
void d_CumKVAH_Import(void)
{
	display_CumKVAH(IMPORT);
}
void d_CumKVARH_Lag_Import(void)
{
	display_CumKVARH(IMPORT,D_LAG);
}
void d_CumKVARH_Lead_Import(void)
{
	display_CumKVARH(IMPORT,D_LEAD);
}
void d_AVGPF_Current_Import(void)
{
	display_Current_AVG_PF(IMPORT);
}

// Current Energies & Average pF Export
void d_CumKWH_Export(void)
{
	display_CumKWH(EXPORT);
}
void d_CumKVAH_Export(void)
{
	display_CumKVAH(EXPORT);
}
void d_CumKVARH_Lag_Export(void)
{
	display_CumKVARH(EXPORT,D_LAG);
}
void d_CumKVARH_Lead_Export(void)
{
	display_CumKVARH(EXPORT,D_LEAD);
}
void d_AVGPF_Current_Export(void)
{
	display_Current_AVG_PF(EXPORT);
}



