Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/display&button/lcd/em_display_TN3P_Helper.c
void d_MD_Current_Import(void)
{
	display_MD_Current(IMPORT);
}
void d_MD_L1_Import(void)
{// for TN MD is kw by default and can be changed to KVA - but only one is to be shown
// hence KW or KVA can be avoided
	display_MD_Billing(IMPORT,1);
}

void d_MD_L2_Import(void)
{
	display_MD_Billing(IMPORT,2);
}

void d_MD_BillDate_Import(void)
{
	display_MD_BillingDateTime_L1(IMPORT, MDDATE);
}
void d_MD_BillTime_Import(void)
{
	display_MD_BillingDateTime_L1(IMPORT, MDTIME);
}
void d_CumMD_Import(void)
{
	display_CumMD(IMPORT);
}



void d_MD_Current_Export(void)
{
	display_MD_Current(EXPORT);
}
void d_MD_L1_Export(void)
{
	display_MD_Billing(EXPORT,1);
}
void d_MD_L2_Export(void)
{
	display_MD_Billing(EXPORT,2);
}
void d_MD_BillDate_Export(void)
{
	display_MD_BillingDateTime_L1(EXPORT, MDDATE);
}
void d_MD_BillTime_Export(void)
{
	display_MD_BillingDateTime_L1(EXPORT, MDTIME);
}
void d_CumMD_Export(void)
{
	display_CumMD(EXPORT);
}



void d_Vrms_R(void)
{
	display_Vrms(LINE_PHASE_R);
	LCD_DisplayDigit(9, LCD_CHAR_R);	
}
void d_Vrms_Y(void)
{
	display_Vrms(LINE_PHASE_Y);
	LCD_DisplayDigit(9, LCD_CHAR_Y);	
}
void d_Vrms_B(void)
{
	display_Vrms(LINE_PHASE_B);
	LCD_DisplayDigit(9, LCD_CHAR_B);	
}
void d_Irms_R(void)
{
	display_Irms(LINE_PHASE_R);
	LCD_DisplayDigit(9, LCD_CHAR_R);	
}
void d_Irms_Y(void)
{
	display_Irms(LINE_PHASE_Y);
	LCD_DisplayDigit(9, LCD_CHAR_Y);	
}
void d_Irms_B(void)
{
	display_Irms(LINE_PHASE_B);
	LCD_DisplayDigit(9, LCD_CHAR_B);	
}
void d_Irms_Neutral(void)
{
	int32_t tempLong;
	tempLong = getInstantaneousParams(ICURRENTS,LINE_NEUTRAL)*1000;
	display_long_three_dp(tempLong);
	lcd_display_A();
	LCD_DisplayDigit(9, LCD_CHAR_N);	
	g_display_flag.fast_display_flag=1;
}


void displaySignedPF(EM_LINE line)
{
	int32_t tempLong;
	EM_PF_SIGN pf_sign;    
	
	pf_sign = (EM_PF_SIGN)getInstantaneousParams(PFSIGNVAL,line);
	
//	if((line==LINE_TOTAL)&&(twoWireOperation!=0))
//		tempLong=operatingPF*1000;
//	else
	tempLong = getInstantaneousParams(IPFS,line)*1000;
	display_long_three_dp(tempLong);
	LCD_DisplayDigit(1, LCD_CHAR_P);	
	LCD_DisplayDigit(2, LCD_CHAR_F);	
	
/*	
	if(exportMode==0)
	{// this is the regular case - import
		if (pf_sign == PF_SIGN_LEAD_C)
		    LCD_DisplayDigit(1, LCD_CHAR_C);
		else if (pf_sign == PF_SIGN_LAG_L)
		    LCD_DisplayDigit(1, LCD_CHAR_L);
		else if (pf_sign == PF_SIGN_UNITY)
		    LCD_ClearDigit(1);
	}
	else
	{
		if (pf_sign == PF_SIGN_LEAD_C)
		    LCD_DisplayDigit(1, LCD_CHAR_L);	// show the ulta
		else if (pf_sign == PF_SIGN_LAG_L)
		    LCD_DisplayDigit(1, LCD_CHAR_C);	// show the ulta
		else if (pf_sign == PF_SIGN_UNITY)
		    LCD_ClearDigit(1);
	}
*/	
}

void d_SystemSignedPF(void)
{
	displaySignedPF(LINE_TOTAL);
//	LCD_DisplayDigit(9, LCD_CHAR_P);
//	LCD_DisplayDigit(8, LCD_CHAR_F);
	LCD_DisplayDigit(9, LCD_CHAR_T);
}
void d_SignedPF_R(void)
{
	displaySignedPF(LINE_PHASE_R);
//	LCD_DisplayDigit(9, LCD_CHAR_P);
	LCD_DisplayDigit(9, LCD_CHAR_R);
}
void d_SignedPF_Y(void)
{
	displaySignedPF(LINE_PHASE_Y);
//	LCD_DisplayDigit(9, LCD_CHAR_P);
	LCD_DisplayDigit(9, LCD_CHAR_Y);
}
void d_SignedPF_B(void)
{
	displaySignedPF(LINE_PHASE_B);
//	LCD_DisplayDigit(9, LCD_CHAR_P);
	LCD_DisplayDigit(9, LCD_CHAR_B);
}
void d_LCDcheck(void)
{
  LCD_DisplayAll();
	gLcdCheck=1;	// global variable to indicate that icon updates must not be carried out
}
void d_MeterSlNo(void)
{
	LCD_DisplayIntWithPos(Common_Data.meterNumber, LCD_LAST_POS_DIGIT);
	lcd_display_id();
}
void d_CurrentDate(void)
{
	EM_DisplayDate();
}
void d_CurrentTime(void)
{
	EM_DisplayInstantTime();
	g_display_flag.fast_display_flag=1;
}
void d_PhaseSequence(void)
{
  int16_t v[EM_NUM_OF_PHASE];	
  powermgmt_mode_t power_mode;
	uint8_t phasesGT170LT300;

	power_mode = POWERMGMT_GetMode();
	if (power_mode != POWERMGMT_MODE3)
	{
		v[LINE_PHASE_R] = (int16_t)(EM_GetVoltageRMS(LINE_PHASE_R)*10);
		v[LINE_PHASE_Y] = (int16_t)(EM_GetVoltageRMS(LINE_PHASE_Y)*10);
		v[LINE_PHASE_B] = (int16_t)(EM_GetVoltageRMS(LINE_PHASE_B)*10);

		phasesGT170LT300 = countVoltageGT170LT300(v[LINE_PHASE_R],v[LINE_PHASE_Y],v[LINE_PHASE_B]);	// returns phases between 170 and 300
		
		if(phasesGT170LT300==3)
		{
			if(gPhaseSequence==0)
			{
				LCD_DisplayDigit(3, LCD_CHAR_R);
				LCD_DisplayDigit(4, LCD_CHAR_Y);
				LCD_DisplayDigit(5, LCD_CHAR_B);
			}
			else
			{
				LCD_DisplayDigit(3, LCD_CHAR_R);
				LCD_DisplayDigit(4, LCD_CHAR_B);
				LCD_DisplayDigit(5, LCD_CHAR_Y);
			}
		}
		else
		{
			LCD_DisplayDigit(3, LCD_MINUS_SIGN);
			LCD_DisplayDigit(4, LCD_MINUS_SIGN);
			LCD_DisplayDigit(5, LCD_MINUS_SIGN);
		}
	}
	else
	{
		LCD_DisplayDigit(3, LCD_MINUS_SIGN);
		LCD_DisplayDigit(4, LCD_MINUS_SIGN);
		LCD_DisplayDigit(5, LCD_MINUS_SIGN);
	}
  LCD_DisplayDigit(9, LCD_CHAR_P);
  LCD_DisplayDigit(8, 5);
}
void d_Frequency(void)
{
	int32_t tempLong;
	tempLong = getInstantaneousParams(IFREQS,LINE_TOTAL)*100;
	display_long_two_dp(tempLong);
  LCD_DisplayDigit(1, LCD_CHAR_F);
  LCD_DisplayDigit(9, LCD_CHAR_H);
  LCD_DisplayDigit(8, 2);
}
void d_ActivePower_R(void)
{
	displayActivePower(LINE_PHASE_R);
	LCD_DisplayDigit(9, LCD_CHAR_R);
}
void d_ActivePower_Y(void)
{
	displayActivePower(LINE_PHASE_Y);
	LCD_DisplayDigit(9, LCD_CHAR_Y);
}
void d_ActivePower_B(void)
{
	displayActivePower(LINE_PHASE_B);
	LCD_DisplayDigit(9, LCD_CHAR_B);
}
void d_ActivePower_Total(void)
{
	displayActivePower(LINE_TOTAL);
	LCD_DisplayDigit(9, LCD_CHAR_T);
}
void d_ApparentPower_Total(void)
{
	displayApparentPower(LINE_TOTAL);
	LCD_DisplayDigit(9, LCD_CHAR_T);
}
void d_RisingDemand_Import(void)
{
	displayRisingDemand(IMPORT);
}
void d_RisingDemand_Export(void)
{
	displayRisingDemand(EXPORT);
}


/*
NOTE:
If we had an eight digit display with a decimal point at 6 then the following code could be used

#ifdef SIX_DECIMALS	
	temp_high_res_energy = ((myenergydata.kwh%1000000)*1000)+(int32_t)(high_resolution_kwh_value);
	display_long_six_dp(temp_high_res_energy);
#else
	temp_high_res_energy = ((myenergydata.kwh%100000)*100)+(int32_t)high_resolution_kwh_value;
	display_long_five_dp(temp_high_res_energy);
#endif
*/



void d_HighRes_KWH_Import(void)
{// see NOTE above
	int32_t temp_high_res_energy;
#ifdef SIX_DECIMALS	
	temp_high_res_energy = ((myenergydata.kwh%100000)*100)+(int32_t)(high_resolution_kwh_value/10);
	display_long_five_dp(temp_high_res_energy);
	LCD_DisplayDigit(9, high_resolution_kwh_value%10);
#else
	temp_high_res_energy = ((myenergydata.kwh%100000)*100)+(int32_t)high_resolution_kwh_value;
	display_long_five_dp(temp_high_res_energy);
#endif
	LCD_DisplaykWhSign();
	LCD_DisplaySpSign(S_IMPORT);
	g_display_flag.fast_display_flag=1;
}

void d_HighRes_KVAH_Import(void)
{
	int32_t temp_high_res_energy;
#ifdef SIX_DECIMALS	
	temp_high_res_energy = ((myenergydata.kvah%100000)*100)+(int32_t)(high_resolution_kvah_value/10);
	display_long_five_dp(temp_high_res_energy);
	LCD_DisplayDigit(9, high_resolution_kvah_value%10);
#else
	temp_high_res_energy = ((myenergydata.kvah%100000)*100)+(int32_t)high_resolution_kvah_value;
	display_long_five_dp(temp_high_res_energy);
#endif
	LCD_DisplaykVAhSign();
	LCD_DisplaySpSign(S_IMPORT);
	g_display_flag.fast_display_flag=1;
}
			
void d_HighRes_KVARH_LAG_Import(void)
{
	int32_t temp_high_res_energy;
#ifdef SIX_DECIMALS	
	temp_high_res_energy = ((myenergydata.kvarh_lag%100000)*100)+(int32_t)(high_resolution_kvarh_lag_value/10);
	display_long_five_dp(temp_high_res_energy);
	LCD_DisplayDigit(9, high_resolution_kvarh_lag_value%10);
#else
	temp_high_res_energy = ((myenergydata.kvarh_lag%100000)*100)+(int32_t)high_resolution_kvarh_lag_value;
	display_long_five_dp(temp_high_res_energy);
#endif
	LCD_DisplaykVArhSign();
//	LCD_DisplayDigit(9, LCD_CHAR_L);
//	LCD_DisplayDigit(8, LCD_CHAR_G);
	LCD_DisplaySpSign(S_IMPORT);
	LCD_DisplaySpSign(S_LAG);
	g_display_flag.fast_display_flag=1;
}
			
