Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/display&button/lcd/em_display_TN3P_Helper.c
void d_HighRes_KVARH_LEAD_Import(void)
{
	int32_t temp_high_res_energy;
#ifdef SIX_DECIMALS	
	temp_high_res_energy = ((myenergydata.kvarh_lead%100000)*100)+(int32_t)(high_resolution_kvarh_lead_value/10);
	display_long_five_dp(temp_high_res_energy);
	LCD_DisplayDigit(9, high_resolution_kvarh_lead_value%10);
#else
	temp_high_res_energy = ((myenergydata.kvarh_lead%100000)*100)+(int32_t)high_resolution_kvarh_lead_value;
	display_long_five_dp(temp_high_res_energy);
#endif
	LCD_DisplaykVArhSign();
//	LCD_DisplayDigit(9, LCD_CHAR_L);
//	LCD_DisplayDigit(8, LCD_CHAR_D);
	LCD_DisplaySpSign(S_IMPORT);
	LCD_DisplaySpSign(S_LEAD);
	g_display_flag.fast_display_flag=1;
}

void d_HighRes_KWH_Export(void)
{
	int32_t temp_high_res_energy;
#ifdef SIX_DECIMALS	
	temp_high_res_energy = ((myenergydata.kwh_export%100000)*100)+(int32_t)(high_resolution_kwh_value_export/10);
	display_long_five_dp(temp_high_res_energy);
	LCD_DisplayDigit(9, high_resolution_kwh_value_export%10);
#else
	temp_high_res_energy = ((myenergydata.kwh_export%100000)*100)+(int32_t)high_resolution_kwh_value_export;
	display_long_five_dp(temp_high_res_energy);
#endif
	LCD_DisplaykWhSign();
//	LCD_DisplayDigit(9, LCD_CHAR_E);
//	LCD_DisplayDigit(8, LCD_CHAR_E);
	LCD_DisplaySpSign(S_EXPORT);
	g_display_flag.fast_display_flag=1;
}
			
void d_HighRes_KVAH_Export(void)
{
	int32_t temp_high_res_energy;
#ifdef SIX_DECIMALS	
	temp_high_res_energy = ((myenergydata.kvah_export%100000)*100)+(int32_t)(high_resolution_kvah_value_export/10);
	display_long_five_dp(temp_high_res_energy);
	LCD_DisplayDigit(9, high_resolution_kvah_value_export%10);
#else
	temp_high_res_energy = ((myenergydata.kvah_export%100000)*100)+(int32_t)high_resolution_kvah_value_export;
	display_long_five_dp(temp_high_res_energy);
#endif
	LCD_DisplaykVAhSign();
//	LCD_DisplayDigit(8, LCD_CHAR_E);
	LCD_DisplaySpSign(S_EXPORT);
	g_display_flag.fast_display_flag=1;
}
			
void d_HighRes_KVARH_LAG_Export(void)
{
	int32_t temp_high_res_energy;
#ifdef SIX_DECIMALS	
	temp_high_res_energy = ((myenergydata.kvarh_lag_export%100000)*100)+(int32_t)(high_resolution_kvarh_lag_value_export/10);
	display_long_five_dp(temp_high_res_energy);
	LCD_DisplayDigit(9, high_resolution_kvarh_lag_value_export%10);
#else
	temp_high_res_energy = ((myenergydata.kvarh_lag_export%100000)*100)+(int32_t)high_resolution_kvarh_lag_value_export;
	display_long_five_dp(temp_high_res_energy);
#endif
	LCD_DisplaykVArhSign();
//	LCD_DisplayDigit(9, LCD_CHAR_L);
//	LCD_DisplayDigit(8, LCD_CHAR_G);
	LCD_DisplaySpSign(S_EXPORT);
	LCD_DisplaySpSign(S_LAG);
	g_display_flag.fast_display_flag=1;
}
			
void d_HighRes_KVARH_LEAD_Export(void)
{
	int32_t temp_high_res_energy;
#ifdef SIX_DECIMALS	
	temp_high_res_energy = ((myenergydata.kvarh_lead_export%100000)*100)+(int32_t)(high_resolution_kvarh_lead_value_export/10);
	display_long_five_dp(temp_high_res_energy);
	LCD_DisplayDigit(9, high_resolution_kvarh_lead_value_export%10);
#else
	temp_high_res_energy = ((myenergydata.kvarh_lead_export%100000)*100)+(int32_t)high_resolution_kvarh_lead_value_export;
	display_long_five_dp(temp_high_res_energy);
#endif
	LCD_DisplaykVArhSign();
//	LCD_DisplayDigit(9, LCD_CHAR_L);
//	LCD_DisplayDigit(8, LCD_CHAR_D);
	LCD_DisplaySpSign(S_EXPORT);
	LCD_DisplaySpSign(S_LEAD);
	g_display_flag.fast_display_flag=1;
}
						































